import img1 from "./images/main.svg";
import img2 from "./images/main2.svg";
import img3 from "./images/main3.svg";
import for1 from "./images/onlineCourses.svg";
import for2 from "./images/creatingTraining.svg";
import attendingClasses from "./images/attendingClasses.svg";
import forStudents from "./images/forStudents.svg";
import homework from "./images/homework.svg";
import learningProcess from "./images/learningProcess.svg";
import managingClasses from "./images/managingClasses.svg";
import records from "./images/records.svg";

export const arrImg = [learningProcess, managingClasses, homework, forStudents, attendingClasses, records];

export const banner = [
    {
        "title": "Ed Space Ваши знания и экспертность обретут здесь форму",
        "text": "Мощный инструмент для организации обучения. Ваши ученики будут в восторге!",
        "image": img1
    },
    {
        "title": "Ed Space Поможет вам развить ваши навыки",
        "text": "Подойдет как взрослым так и детям!",
        "image": img2
    },
    {
        "title": "Ed Space Поможет вам выбрать направление обучения",
        "text": "При возникновении трудностей вы всегда можете оставить контакты для обратно связи!",
        "image": img3
    }
];

export const cardRow = [
    {
        "title": "Организация онлайн курсов",
        "text": "Cоздайте свою программу обучения с нуля, самостоятельно управляйте учебным процессом в несколько кликов, круглосуточная поддержка.",
        "image": for1
    },
    {
        "title": "Создания корпоративного обучения",
        "text": "Поможем перенести корпоративную академию, базу знаний, учебные курсы, настроим систему мотивации обучения, круглосуточная поддержка.",
        "image": for2
    }
];

export const cardCol = [
    {
        "title": "Организация учебного процесса",
        "text": "Управляйте процессом обучения. Наблюдайте за будущими, текущими и завершенными курсами в одном окне.",
        "image": learningProcess,
        "possibility": ["Расписание занятий", "Расписание сессий", "Экзамены",  ]
    },
    {
        "title": "Управление расписанием занятий",
        "text": "Спланируйте расписание курсов самым удобным образом. Больше никаких накладок и переносов.",
        "image": managingClasses,
        "possibility": ["Формирование графика преподавателей и учеников",  "Обновление расписания на еженедельной основе"]
    },
    {
        "title": "Администрирование домашних заданий",
        "text": "Отслеживайте прогресс обучения индивидуально по каждому ученику.",
        "image": homework,
        "possibility": ["Проверка домашних заданий", "Использование дополнительных программ учениками для выполнения домашнего задания", "Опрос учащихся"]
    },
    {
        "title": "Задания для учеников",
        "text": "Каждый ученик может видеть домашние задания от преподавателя, отслеживать статус их проверки и собственный уровень прогресса в обучении.",
        "image": forStudents,
        "possibility": ["Создание домашнего задание после проведения лекций", "Предоставление обратной связи от преподавателя ученику", "Выставление оценки по каждому выполненному заданию"]
    },
    {
        "title": "Мониторинг посещения занятий",
        "text": "Просматривайте посещаемость каждого ученика на курсе. Отстающих больше не будет.",
        "image": attendingClasses,
        "possibility": ["Проверка присутствия учеников на занятии", "Мотивация учащихся к регулярному посещению"]
    },
    {
        "title": "Записи хранятся на платформе",
        "text": "Спланируйте расписание курсов самым удобным образом. Больше никаких накладок и переносов.",
        "image": records,
        "possibility": ["Хранение данных на учебном портале", "Предоставление доступа к личному кабинету учащимся для просмотра записей",]
    }
];

export const firstTextBlock = [
    {
        "title": "Запустите свою онлайн-школу",
        "text": "Или разверните корпоративный учебный портал уже сегодня."
    },
    {
        "title": "Цена 250 рублей за 1 ученика в месяц",
        "text": "Все готово для запуска. Попробуйте 7-дневный демо-доступ."
    }
];

export const secondTextBlock = [
    {
        "title": "Любых онлайн-школ",
        "text": "Быстрый запуск, легкое управление, все инструменты в одной платформе."
    },
    {
        "title": "Образовательных курсов",
        "text": "Статистика по всем образовательным процессам позволяет постоянно улучшать ваш продукт."
    },
    {
        "title": "Корпоративных учебных порталов",
        "text": "Надежная защита, бесперебойная работа и высокая производительность системы позволит наслаждаться процессом обучения."
    }
]

export const footer = [
    {
        "name": "Меню:",
        "list": ["Возможности", "Стоимость", "Выбор Ed Space"],
        "links": ["", "", ""]
    },
    {
        "name": "Документы:",
        "list": ["Пользовательское соглашение", "Публичная оферта"],
        "links": ["https://ru.wikipedia.org/wiki/Пользовательское_соглашение", "https://ru.wikipedia.org/wiki/%D0%9E%D1%84%D0%B5%D1%80%D1%82%D0%B0"]
    },
    {
        "name": "Контакты:",
        "list": ["admin@site.com", "+7 (900) 123-45-67", "+7 (999) 876-54-32"],
        "links": [""]
    }
]

export const list = [
    "Неограниченное колличество учеников",
    "Трансляции",
    "Точную статистику",
    "Производительную видеосвязь с учениками",
    "Продукт с ежемесячной подпиской",
    "Лучшую конфиденциальность и защиту",
    "Готовый шаблон для организации обучения",
    "Сообщества",
    "Любое количество уроков и учебных программ"
]

export const price = [
    {
        "title": "1500 рублей", 
    },
]